In [5]:
import math
import pandas as pd

In [12]:
df = pd.read_csv("New1.csv")
df

     Name   Address  Country Good bad
0  Subodh  Barangdi    Nepal    1   0
1   Suraj  Kawaseti    Nepal    1   0
2    John  Mechigan      USA    0   1
3     NaN   Chelsea  England  yes  no
4     NaN        -1    Spain    1  no

In [22]:
df=pd.read_csv("New1.csv",header=None,names=["Name","Address","Country","Good","bad"])
df

     Name   Address  Country  Good  bad
0    Name   Address  Country  Good  bad
1  Subodh  Barangdi    Nepal     1    0
2   Suraj  Kawaseti    Nepal     1    0
3    John  Mechigan      USA     0    1
4     NaN   Chelsea  England   yes   no
5     NaN        -1    Spain     1   no

In [71]:
df = pd.read_csv("New1.csv",skiprows=1)
df

  Subodh  Barangdi    Nepal    1   0
0  Suraj  Kawaseti    Nepal    1   0
1   John  Mechigan      USA    0   1
2    NaN   Chelsea  England  yes  no
3    NaN        -1    Spain    1  no

In [74]:
df = pd.read_csv("New1.csv",na_values=[-1,0])
df = pd.read_csv("New1.csv",
                 na_values={
                    "Good":[0],
                    "bad":[0,"no"],
                     "Address":[-1]
                        },
                )                              #for na_values we can pass dictonary or a list
df

     Name   Address  Country Good  bad
0  Subodh  Barangdi    Nepal    1  NaN
1   Suraj  Kawaseti    Nepal    1  NaN
2    John  Mechigan      USA  NaN  1.0
3     NaN   Chelsea  England  yes  NaN
4     NaN       NaN    Spain    1  NaN

In [87]:
df.to_csv("created.csv")

In [90]:
ef=pd.read_csv("created.csv")
ef

   Unnamed: 0    Name   Address  Country Good  bad
0           0  Subodh  Barangdi    Nepal    1  NaN
1           1   Suraj  Kawaseti    Nepal    1  NaN
2           2    John  Mechigan      USA  NaN  1.0
3           3     NaN   Chelsea  England  yes  NaN
4           4     NaN       NaN    Spain    1  NaN